Autodesk.Revit.DB.IFC.IFCTransaction.RollBack
Rolls back all changes made to the IFC file during the transaction.
Since:
2012

Autodesk.Revit.DB.IFC.IFCTransaction.Commit
Commits all changes made to the IFC file during the transaction.
Since:
2012

Autodesk.Revit.DB.IFC.IFCTransaction.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCTransaction.#ctor(Autodesk.Revit.DB.IFC.IFCFile)
Instantiates a transaction object.
Remarks:
The transaction starts by creating a transaction object.
file:
The IFC file for which this transaction is going to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.IFCTransaction
IFC transactions are context-like objects that guard any changes made to an IFC file.
Remarks:
Any change to an IFC file can only be made while there is an active transaction
open for that file. Changes do not become a part of the file until the
active transaction is committed. Consequently, all
changes made in a transaction can be rolled back
either explicitly or implicitly (by the destructor).
Since:
2012